print('Homework 6\n')

print('\nFunction 2\n')
# Найдите три ключа с самыми высокими значениями в словаре
# my_dict = {'a':645, 'b':3987, 'c': 093,'d':111, 'e':646, 'f': 20}
